# IsFilled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments..::..IsFilled Property
PolylineSegments Class See Also
---
Indicates whether the area enclosed by the polyline is to be filled or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsFilled { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFilled As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFilled {
	bool get ();
}
```

# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace